enum Faq {
  account,
  point,
  reward,
  general,
  policy,
}

extension FaqExtension on Faq {
  String get title {
    switch (this) {
      case Faq.account:
        return "บัญชีและการตั้งค่า";
      case Faq.general:
        return "การสะสมแต้ม";
      case Faq.point:
        return "การแลกของรางวัล";
      case Faq.reward:
        return "ปัญหาและการแก้ไขเบื้องต้น";
      case Faq.policy:
        return "เงื่อนไขและนโยบาย";
    }
  }

  List<String> get items {
    switch (this) {
      case Faq.account:
        return [
          "Q: ฉันจะสมัครสมาชิกได้อย่างไร?",
          "A: คุณสามารถสมัครสมาชิกได้โดยใช้ อีเมล/เบอร์โทรศัพท์ หรือ บัญชีโซเชียลมีเดีย ผ่านหน้า \"สมัครสมาชิก\" บนแอป",
          "Q: ลืมรหัสผ่านต้องทำอย่างไร?",
          "A: กด \"ลืมรหัสผ่าน\" บนหน้าล็อกอิน และทำตามขั้นตอนที่ระบุเพื่อรีเซ็ตรหัสผ่าน",
          "Q:ฉันสามารถเปลี่ยนอีเมลหรือหมายเลขโทรศัพท์ได้หรือไม่?",
          "A: ได้ คุณสามารถแก้ไขข้อมูลได้ที่ บัญชีผู้ใช้งาน"
        ];
      case Faq.general:
        return [
          "Q: ฉันจะได้รับแต้มอย่างไร? A: คุณสามารถรับแต้มได้จากการร่วมกิจกรรมพิเศษหรือทำภารกิจบนแอป",
          "Q: แต้มหมดอายุหรือไม่?",
          "A: แต้มอาจมีวันหมดอายุ ขึ้นอยู่กับเงื่อนไขของแต่ละโปรโมชั่น",
          "Q: ฉันสามารถโอนแต้มให้เพื่อนได้หรือไม่?",
          "A: ขณะนี้ยังไม่รองรับการโอนแต้มระหว่างบัญชี"
        ];
      case Faq.point:
        return [
          "Q: ฉันจะแลกของรางวัลได้อย่างไร?",
          "A: ไปที่ กิจกรรม เลือกของรางวัลที่ต้องการและกด \"แลกรับสิทธิ์\" ระบบจะหักแต้มโดยอัตโนมัติ",
          "Q: สามารถยกเลิกหรือเปลี่ยนของรางวัลหลังจากแลกแล้วได้หรือไม่?",
          "A: โดยทั่วไปไม่สามารถยกเลิกหรือเปลี่ยนของรางวัลได้ ยกเว้นในกรณีที่มีปัญหาจากระบบ"
        ];
      case Faq.reward:
        return [
          "Q: ฉันไม่ได้รับแต้มหลังจากทำรายการ ต้องทำอย่างไร?A: กรุณาตรวจสอบเงื่อนไขของการได้รับแต้ม หากผ่านไป 24 ชั่วโมงแล้วยังไม่ได้รับแต้ม กรุณาติดต่อฝ่ายบริการลูกค้า",
          "Q: แอปใช้งานไม่ได้ โหลดช้า หรือค้าง ควรทำอย่างไร?",
          "A: ลองทำตามขั้นตอนต่อไปนี้ปิดแอปแล้วเปิดใหม่\n - ตรวจสอบการเชื่อมต่ออินเทอร์เน็ต\n - อัปเดตแอปเป็นเวอร์ชันล่าสุด"
        ];
      case Faq.policy:
        return [
          "Q: แต้มที่ฉันได้รับสามารถแลกเป็นเงินสดได้หรือไม่?",
          "A: ไม่ได้ แต้มสามารถใช้แลกของรางวัลหรือสิทธิพิเศษที่กำหนดเท่านั้น",
          "Q: ฉันสามารถอ่านเงื่อนไขการใช้งานและนโยบายความเป็นส่วนตัวได้ที่ไหน?",
          "A: คุณสามารถดูรายละเอียดได้ที่ โปรไฟล์ > นโยบายความเป็นส่วนตัว"
        ];
    }
  }
}
